[skills_novice.A_ArcaneCatalyst_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狡诈"
mTooltip="受 %spell1.name 影响的单位在发动侧击时造成20%额外伤害，并获得 %spell2.name 能力。"

[skills_novice_2.A_ArcaneChanneling_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="细胞再生"
mTooltip="受 %spell.name 影响的单位在回合开始时根据其数量和等级恢复一定量的 %icon_Health 生命值。\n核心生物恢复2 %icon_Health，\n精英生物恢复5 %icon_health，\n冠军生物恢复30 %icon_health。"

[skills_novice_3.A_ArcaneShield_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="决意"
mTooltip="受 %spell1.name 影响的单位获得+15 %icon_morale 士气并获得 %spell2.name 能力。"

[skills_expert.A_ArcaneBrillance_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="疾驰"
mTooltip="受 %spell1.name 影响的单位无法被减速并获得 %spell2.name 能力。"

[skills_expert2.A_LightningBolt H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="改良抗体"
mTooltip="受 %spell1.name 影响的单位还将对毒素免疫并获得 %spell2.name 能力。"

[skills_master.A_ArcaneAttunement_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="腐蚀幸运"
mTooltip="受 %spell1.name 影响的单位获得+15 %icon_luck 幸运，并在其回合结束时对相邻敌方生物施加 %spell2.name 毒素。"

[skills_grand_master.A_SummonElemental H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="基因链接"
mTooltip="英雄在战斗结束前，每次施放变异剂都会获得 %buff.buff.buff.buff.stat1 %icon_attack 攻击和 %buff.buff.buff.buff.stat2 %icon_magic 魔力。变异剂不再施加负面效果。"

[skills_expert.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="增加友方单位的 %icon_movement 移动力 %buff1.buff.stat1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"
mName="敏捷变异剂"
mTooltip="增加友方单位的 %icon_movement 移动力 %buff1.buff.stat1，但降低该单位侧击造成的伤害 %buff2.buff.stat1%。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"

[skills_novice.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="增加友方单位的总修正 %icon_attack 攻击 %buff1.buff.stat1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"
mName="狂怒变异剂"
mTooltip="增加友方单位的总修正 %icon_attack 攻击 %buff1.buff.stat1，但将总修正 %icon_defense 防御降低至 %buff2.buff.stat1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"

[skills_novice_3.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="此单位无法被侧击。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"
mName="警觉变异剂"
mTooltip="此单位无法被侧击，但其 %icon_movement 移动力降低至 %buff2.buff.stat1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"

[skills_novice_2.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="增加友方单位的 %icon_defense 防御 %buff1.buff.stat1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"
mName="坚韧变异剂"
mTooltip="增加友方单位的 %icon_defense 防御 %buff1.buff.stat1，但降低友方单位的 %icon_initiative 主动性 %buff2.buff.stat1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"

[skills_master.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="增加友方单位的基础最大伤害 %buff1.buff.stat1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"
mName="力量变异剂"
mTooltip="增加友方单位的最大伤害 %buff1.buff.stat1，但降低最小伤害 %buff2.buff.stat1。\n对亡灵或构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"

[skills_expert2.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="减少友方单位受到的魔法伤害 %buff1.buff.res1。\n对亡灵和构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"
mName="反魔法变异剂"
mTooltip="减少友方单位受到的魔法伤害 %buff1.buff.res1，但增加受到的物理伤害 %buff2.buff.res1。\n对亡灵或构造体无效。\n持续 %buff1.buff.durini 回合。\n冷却时间：6回合。"


[skills_novice.A_MutagenOfAnger_Buff H7BaseBuff]
mName="狂怒变异剂（强化）"
mTooltip="增加单位 %icon_attack 攻击 %stat1。\n持续：%durnow 回合。"

[skills_novice.A_MutagenOfAnger_Debuff H7BaseBuff]
mName="狂怒变异剂（削弱）"
mTooltip="将单位的 %icon_defense 防御降低至 %stat1。\n持续 %durnow 回合。"

[skills_novice_3.A_MutagenOfVigilance_Buff H7BaseBuff]
mName="警觉变异剂（强化）"
mTooltip="此单位无法被侧击。\n持续 %durnow 回合。"

[skills_novice_3.A_MutagenOfVigilance_Debuff H7BaseBuff]
mName="警觉变异剂（削弱）"
mTooltip="将 %icon_movement 移动力降低至 %stat1。\n持续 %durnow 回合。"

[skills_novice_2.A_MutagenOfToughness_Buff H7BaseBuff]
mName="坚韧变异剂（强化）"
mTooltip="增加单位的 %icon_defense 防御 %stat1。\n持续 %durnow 回合。"

[skills_novice_2.A_MutagenOfToughness_Debuff H7BaseBuff]
mName="坚韧变异剂（削弱）"
mTooltip="将单位的 %icon_initiative 主动性降低至 %stat1。\n持续 %durnow 回合。"

[skills_expert2.A_MutagenOfProtection_Buff H7BaseBuff]
mName="反魔法变异剂（强化）"
mTooltip="增加魔法抗性 %res1。\n持续 %durnow 回合。"

[skills_expert2.A_MutagenOfProtection_Debuff H7BaseBuff]
mName="反魔法变异剂（削弱）"
mTooltip="降低物理抗性 %res1。\n持续 %durnow 回合。"

[skills_expert.A_MutagenOfAgility_Buff H7BaseBuff]
mName="敏捷变异剂（强化）"
mTooltip="增加单位 %icon_movement 移动力 %stat1。\n持续 %durnow 回合。"

[skills_expert.A_MutagenOfAgility_Debuff H7BaseBuff]
mName="敏捷变异剂（削弱）"
mTooltip="此单位的侧击奖励减少 %stat1%。\n持续 %durnow 回合。"

[skills_master.A_MutagenOfFury_Buff H7BaseBuff]
mName="狂怒变异剂（强化）"
mTooltip="增加单位最大伤害 %stat1。\n持续 %durnow 回合。"

[skills_master.A_MutagenOfFury_Debuff H7BaseBuff]
mName="狂怒变异剂（削弱）"
mTooltip="降低单位最小伤害 %stat1。\n持续 %durnow 回合。"

[skills_master.A_Mutagen_toxique_champion_Buff H7BaseBuff]
mName="剧毒变异剂"
mTooltip="在 %durnow 回合内，于其回合开始时对生物造成 %d1 伤害。"

[skills_master.A_Mutagen_toxique_core_Buff H7BaseBuff]
mName="剧毒变异剂"
mTooltip="在 %durnow 回合内，于其回合开始时对此生物造成 %d1 伤害。"

[skills_master.A_Mutagen_toxique_elite_Buff H7BaseBuff]
mName="剧毒变异剂"
mTooltip="在 %durnow 回合内，于其回合开始时对此生物造成 %d1 伤害。"


[Mutagene_config.A_no_rage_creature H7BaseBuff]
mName="狂怒变异剂冷却中"
mTooltip="此英雄在接下来的 %durnow 回合内无法使用狂怒变异剂。"

[Mutagene_config.A_no_robustesse_creature H7BaseBuff]
mName="坚韧变异剂冷却中"
mTooltip="此英雄在接下来的 %durnow 回合内无法使用坚韧变异剂。"

[Mutagene_config.A_no_vigilance_creature H7BaseBuff]
mName="警觉变异剂冷却中"
mTooltip="此英雄在接下来的 %durnow 回合内无法使用警觉变异剂。"

[Mutagene_config.A_no_Anti_Magie_creature H7BaseBuff]
mName="反魔法变异剂冷却中"
mTooltip="此英雄在接下来的 %durnow 回合内无法使用反魔法变异剂。"

[Mutagene_config.A_no_agility_creature H7BaseBuff]
mName="敏捷变异剂冷却中"
mTooltip="此英雄在接下来的 %durnow 回合内无法使用敏捷变异剂。"

[Mutagene_config.A_no_Puissance_creature H7BaseBuff]
mName="力量变异剂冷却中"
mTooltip="此英雄在接下来的 %durnow 回合内无法使用力量变异剂。"

[skills_grand_master.A_Mutagenesis_Archgen_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="始祖基因"
mTooltip="英雄在战斗结束前，每次施放变异剂都会获得 %buff.buff.buff.buff.stat1 %icon_attack 攻击和 %buff.buff.buff.buff.stat2 %icon_magic 魔力。所有变异剂的负面效果被取消。"

[skills_grand_master.A_Archgen_Buff_Stats H7BaseBuff]
mName="始祖基因"
mTooltip=""

[skills_grand_master.A_Archgen_Buff H7BaseBuff]
mName=""
mTooltip=""

[skills.A_Mutagenesis_FreeTurn_Buff H7BaseBuff]
mName="变异剂 - 额外回合"
mTooltip=""


v1.37

-Cleaned up the descriptions for skills (Renewal) and mutagens (Agility, Fury, Vigilance, Robustness, Power, and Anti-magic), to be more clear

v1.38

[skills.Metamagic_skill H7Skill]
mDescriptions[0]="英雄对其单位施加强大的辐射，改变其属性和能力。\n每种变异剂的冷却时间为6回合。"
mDescriptions[1]=""
mDescriptions[2]="授予英雄使用 %spell1.spell.name、%spell2.spell.name 和 %spell3.spell.name 的权限。\n变异剂的持续时间为1回合。\n每种变异剂的冷却时间为6回合。"
mDescriptions[3]="授予英雄使用 %spell4.spell.name 和 %spell5.spell.name 的权限。\n变异剂的持续时间增加至2回合。\n每种变异剂的冷却时间为6回合。"
mDescriptions[4]="授予英雄使用 %spell6.spell.name 的权限。\n变异剂的持续时间增加至4回合。\n每种变异剂的冷却时间为6回合。"
mName="变异术"
mTooltip="秽巢阵营技能"